load_tests/load_test.yml
config:
  target: 'http://0.0.0.0:3001' # Your backend
  phases:
    - duration: 20 # 20 seconds
      arrivalRate: 100 # 100 tx/sec
      name: 'Low Load'
    - duration: 20 # 20 seconds
      arrivalRate: 500
      name: 'Medium Load'
    - duration: 20 # 20 seconds
      arrivalRate: 1000
      name: 'High Load'
  defaults:
    headers:
      Authorization: 'Bearer 7a28b4cd5e614a5688b36639c4af959d9641def00f33f8951da1fa2bf0726359'
      Content-Type: 'application/json'

scenarios:
  - flow:
      - post:
          url: '/send_transaction'
          json:
            raw_tx:
              nonce: '0x0'
              from: '0x1111111111111111111111111111111111111111'
              to: '0x2222222222222222222222222222222222222222'
              value: '0xde0b6b3a7640000'
              data: '0x68656c6c6f'
              gas_limit: '0x5208'
              gas_price: '0x6fc23ac00'
              chain_id: 42161
              l1_block_number: 0
              submission_fee: '0xf4240'